<template>
  <!-- 设备组件关系图 -->
  <div
    :class="className"
    :id="id"
    :style="{ height: height, width: width, top: top }"
    :list="detaillist"
    :currentNodeInfo="currentNodeInfo"
  ></div>
</template>

<script>
import echarts from "echarts";
import resize from "../../components/Charts/mixins/resize";
/* eslint-disable */
export default {
  name: "deploy-bind-er",
  mixins: [resize],
  props: {
    // 设备 数组 shua
    detaillist: {
      type: Array,
      default: []
    },
    // 组件 对象
    currentNodeInfo: {
      type: Object,
      default: {}
    },
    className: {
      type: String,
      default: "chart"
    },
    id: {
      type: String,
      default: "chart"
    },
    width: {
      type: String,
      default: "100%"
    },
    height: {
      type: String,
      default: "100%"
    },
    top: {
      type: String,
      default: "15px"
    }
  },
  data() {
    return {
      chart: null,
      list: [],
      dataList: [],
      dataItem: {},
      linksList: [],
      linksItem: {},
      centerDevice: {},
      centerX: 300,
      centerY: 400,
      childX: 550,
      stepY: 200,
      title: "设备组件关系图"
    };
  },
  mounted() {
    this.initChart();
  },
  beforeDestroy() {
    if (!this.chart) {
      return;
    }
    this.chart.dispose();
    this.chart = null;
  },
  methods: {
    initChart() {
      this.chart = echarts.init(document.getElementById(this.id));
      this.chart.setOption({
        title: {
          text: this.title //'设备组件关系图'
        },
        tooltip: {
          // 鼠标hover事件.经过tooltip冒泡事件
          formatter: function(x) {
            var res;
            if (x.data.deviceInfo) {
              res =
                "<div><p>名称：" +
                x.data.name +
                "</p></div>" +
                "<div><p>IP：" +
                x.data.deviceInfo +
                "</p></div>";
            } else if (x.data.info) {
              res =
                "<div><p>名称：" +
                x.data.info.componentEntity.name +
                "</p></div>" +
                "<div><p>路径：" +
                x.data.info.componentEntity.relativePath +
                "</p></div>" +
                "<div><p>版本：" +
                x.data.info.componentEntity.version +
                "</p></div>" +
                "<div><p>时间：" +
                x.data.info.componentHistoryEntity.createTime +
                "</p></div>";
            }
            return res;
          }
        },
        // 数据更新动画的时长
        animationDurationUpdate: 300,
        // 数据更新动画的缓动效果。
        animationEasingUpdate: "quinticInOut",
        // 系列列表,每个系列通过type决定自己的图表类型
        series: [
          {
            // 用于展现节点以及节点之间的关系数据。
            type: "graph",
            // 图的布局，'circular' 采用环形布局，
            layout: "circular",
            // 关系图节点标记的大小，
            symbolSize: 30,
            // 图形样式。
            itemStyle: {
              normal: {
                color: "rgb(79, 97, 185)"
              }
            },
            // 关系图节点标记的图形。可以通过 'path://' 将图标设置为任意的矢量路径。
            symbol:
              // "path://M723.626667 853.333333 614.4 853.333333l0-109.226667 112.64 0 0-71.68L71.68 672.426667 71.68 153.6l853.333333 0L925.013333 443.733333l58.026667 0c3.413333 0 10.24 0 13.653333 3.413333L996.693333 129.706667c0-27.306667-20.48-47.786667-47.786667-47.786667L47.786667 81.92C20.48 81.92 0 102.4 0 129.706667l0 566.613333c0 27.306667 20.48 47.786667 47.786667 47.786667l337.92 0L385.706667 853.333333 256 853.333333c-23.893333 0-44.373333 20.48-44.373333 44.373333 0 23.893333 20.48 44.373333 44.373333 44.373333l481.28 0c-6.826667-10.24-10.24-20.48-10.24-30.72L727.04 853.333333 723.626667 853.333333z M993.28 467.626667l-201.386667 0c-17.066667 0-30.72 13.653333-30.72 30.72l0 409.6c0 17.066667 13.653333 30.72 30.72 30.72l201.386667 0c17.066667 0 30.72-13.653333 30.72-30.72l0-409.6C1024 484.693333 1010.346667 467.626667 993.28 467.626667zM890.88 921.6c-6.826667 0-13.653333-6.826667-13.653333-13.653333 0-6.826667 6.826667-13.653333 13.653333-13.653333s13.653333 6.826667 13.653333 13.653333C904.533333 914.773333 897.706667 921.6 890.88 921.6zM1003.52 877.226667l-225.28 0 0-341.333333 225.28 0L1003.52 877.226667z",
              "path://M662.656 717.056l-7.04-83.584-63.104-4.096c-7.808-26.112-19.584-50.304-34.432-72.064l37.12-49.92-59.136-59.392-51.456 37.76c-22.144-14.336-46.464-25.472-72.192-32.64l-3.712-62.976-83.456-7.552-15.36 63.232c-26.624 3.328-51.712 10.624-75.008 21.248l-44.288-46.976L121.6 468.096l29.568 59.648c-17.28 18.816-31.872 40.192-43.008 63.36l-65.536-7.552-21.888 80.896 61.824 27.136c-0.512 11.392-0.384 23.04 0.64 34.816 1.152 13.952 3.456 27.52 6.656 40.704l-55.552 36.608 35.2 76.032 64.896-18.944c15.36 20.352 33.536 38.4 54.016 53.504l-18.944 63.36 75.904 35.584 36.992-55.424c24.576 5.888 50.304 8.192 76.8 6.528l25.728 59.648 81.024-21.504-7.168-64.768c23.808-11.776 45.312-27.008 64.256-45.056l56.704 28.416 48.256-68.48-46.08-44.032c10.496-24.064 17.408-50.048 20.224-77.056l60.544-14.464z m-309.632 108.416c-66.816 5.632-125.696-43.904-131.328-110.848-5.632-66.816 43.904-125.696 110.848-131.328 66.816-5.632 125.696 43.904 131.328 110.848 5.632 66.816-44.032 125.568-110.848 131.328zM954.752 422.528l33.92-60.416-41.216-32c6.784-21.504 9.984-43.52 9.856-65.28l48.64-16.896-12.8-68.096-52.736 1.92c-8.448-20.096-19.968-38.912-34.304-55.808l26.624-44.8L879.232 37.12l-39.936 36.096c-19.712-9.984-40.32-16.768-61.184-20.224L769.664 0.384l-69.248 0.768-7.552 54.528c-20.608 4.864-40.448 12.672-58.88 23.296l-41.216-35.584-52.48 45.184 29.696 47.36c-5.76 7.552-11.008 15.616-15.744 24.064-5.632 10.112-10.368 20.48-14.336 30.976l-55.04-0.768L473.6 258.56l53.12 17.152c1.024 21.12 5.12 41.856 12.16 61.696l-42.368 34.56 35.328 59.52 50.944-20.736c14.08 15.36 30.592 28.928 49.408 40.064l-9.984 52.736 65.408 22.912 25.216-47.616c21.76 2.944 43.52 2.56 64.896-1.024l25.6 45.696 64.768-24.448-11.136-51.584c18.432-11.52 35.2-26.112 49.536-43.264l48.256 18.304z m-268.8-57.344c-55.168-30.976-74.752-100.736-43.776-155.904 30.976-55.168 100.736-74.752 155.904-43.776 55.168 30.976 74.752 100.736 43.776 155.904-30.976 55.168-100.736 74.752-155.904 43.776zM439.68 319.488l16.512-29.44-20.096-15.616c3.328-10.496 4.864-21.12 4.864-31.744l23.68-8.192-6.272-33.152-25.6 0.896c-4.096-9.728-9.728-18.944-16.64-27.136l13.056-21.76-26.24-21.504-19.456 17.536c-9.6-4.864-19.584-8.192-29.824-9.856l-4.096-25.6-33.792 0.384-3.712 26.496c-9.984 2.304-19.712 6.144-28.672 11.392l-20.096-17.28-25.6 22.016 14.464 23.04c-2.816 3.712-5.376 7.552-7.68 11.648-2.816 4.864-5.12 9.984-6.912 15.104l-26.752-0.384-5.504 33.28 25.856 8.32c0.512 10.24 2.432 20.352 5.888 29.952l-20.608 16.896 17.152 29.056 24.832-10.112c6.784 7.552 14.848 14.08 24.064 19.584l-4.864 25.728 31.872 11.136 12.288-23.168c10.624 1.408 21.248 1.28 31.616-0.512l12.416 22.272 31.616-11.904-5.376-25.088c8.96-5.632 17.152-12.672 24.192-21.12l23.424 8.832z m-130.944-27.904c-26.88-15.104-36.352-49.024-21.248-75.904 15.104-26.88 49.024-36.352 75.904-21.248 26.88 15.104 36.352 49.024 21.248 75.904-15.104 26.752-49.024 36.352-75.904 21.248z",
            // 是否开启鼠标缩放和平移漫游,默认不开启。
            // 如果只想要开启缩放或者平移,可以设置成'scale'或者'move',设置成 true 为都开启
            roam: true,
            // 图形上的文本标签，可用于说明图形的一些数据信息，比如值，名称等，
            label: {
              normal: {
                show: true,
                position: "top",
                textStyle: {
                  fontSize: 16,
                  fontFamily: "Arial",
                  fontWeight: 700,
                  textShadow: "none",
                  color: "#777"
                }
              }
            },
            // 边两端的标记类型，可以是一个数组分别指定两端，也可以是单个统一指定。
            // 默认不显示标记，常见的可以设置为箭头
            edgeSymbol: ["circle", "arrow"],
            // 边两端的标记大小，可以是一个数组，分别指定两端，也可以是单个统一指定。
            edgeSymbolSize: [4, 10],
            edgeLabel: {
              normal: {
                textStyle: {
                  fontSize: 16
                }
              }
            },
            // 关系图的节点数据列表 数组
            data: this.dataList,
            // 指定节点间的关系数据 数组
            links: this.linksList
          }
        ]
      });
    },
    // 初始化配置
    initConfig() {
      // console.log(this.list);
      // 先定义一个空节点 数据列表 数组
      this.dataList = [];
      // 定义指定节点间的关系数据 数组
      this.linksList = [];
      // 第一步 拿到了当前节点绑定所有组件和设备的信息
      // 这也就意味着，必须先绑定组件，再绑定设备，才能显示关系图；
      // 如果先绑定设备，关系图无法显示绑定设备，再次点击绑定组件才能显示关系图
      // 底下代码按照此逻辑
      console.log(this.list);
      // 第二步 首先判断是否绑定了组件
      if (this.list.length > 0) {
        // 在绑定了组件情况下，绑定了设备
        if (this.list[0].deploymentDesignNodeEntity.deviceEntity !== null) {
          // 在centerDevice这个对象中动态追加属性：name和deviceInfo
          this.list[0].deploymentDesignNodeEntity.deviceEntity.forEach(item => {
            this.centerDevice = {
              name: item.name,
              /*x: this.centerX,
              y: this.centerY,*/
              // 绑定设备图标
              symbol:
                "path://M723.626667 853.333333 614.4 853.333333l0-109.226667 112.64 0 0-71.68L71.68 672.426667 71.68 153.6l853.333333 0L925.013333 443.733333l58.026667 0c3.413333 0 10.24 0 13.653333 3.413333L996.693333 129.706667c0-27.306667-20.48-47.786667-47.786667-47.786667L47.786667 81.92C20.48 81.92 0 102.4 0 129.706667l0 566.613333c0 27.306667 20.48 47.786667 47.786667 47.786667l337.92 0L385.706667 853.333333 256 853.333333c-23.893333 0-44.373333 20.48-44.373333 44.373333 0 23.893333 20.48 44.373333 44.373333 44.373333l481.28 0c-6.826667-10.24-10.24-20.48-10.24-30.72L727.04 853.333333 723.626667 853.333333z M993.28 467.626667l-201.386667 0c-17.066667 0-30.72 13.653333-30.72 30.72l0 409.6c0 17.066667 13.653333 30.72 30.72 30.72l201.386667 0c17.066667 0 30.72-13.653333 30.72-30.72l0-409.6C1024 484.693333 1010.346667 467.626667 993.28 467.626667zM890.88 921.6c-6.826667 0-13.653333-6.826667-13.653333-13.653333 0-6.826667 6.826667-13.653333 13.653333-13.653333s13.653333 6.826667 13.653333 13.653333C904.533333 914.773333 897.706667 921.6 890.88 921.6zM1003.52 877.226667l-225.28 0 0-341.333333 225.28 0L1003.52 877.226667z",
              symbolSize: 40,
              itemStyle: {
                normal: {
                  // color: '#42b983',
                  color: "rgb(55, 148, 255)"
                }
              },
              // 绑定的设备信息
              deviceInfo: item.hostAddress
            };
            this.dataList.push(this.centerDevice);
          });
        } else {
          // 绑定了组件，未绑定设备
          this.centerDevice = {
            name: "暂未绑定设备",
            symbolSize: 40,
            symbol: "circle",
            itemStyle: {
              normal: {
                color: "#ccc"
              }
            },
            deviceInfo: {}
          };
        }
      } else {
        // 未绑定组件情况下,未绑定设备
        if (this.currentNodeInfo.deviceEntity.length === 0) {
          this.centerDevice = {
            name: "暂未绑定设备与组件",
            symbol: "circle",
            symbolSize: 40,
            itemStyle: {
              normal: {
                // color: '#42b983',
                // color: 'rgb(55, 148, 255)',
                color: "#ccc"
              }
            },
            deviceInfo: {}
          };
          this.initChart();
        } else {
          // 未绑定组件的情况下,绑定了设备
          let deviceAddress = this.currentNodeInfo.deviceEntity
            ? this.currentNodeInfo.deviceEntity.hostAddress + "暂未绑定组件"
            : "暂未绑定组件";
          this.currentNodeInfo.deviceEntity.forEach(item => {
            this.centerDevice = {
              // 未绑定组件 绑定了设备
              name: item.hostAddress,
              // 绑定设备图标
              symbol:
                "path://M723.626667 853.333333 614.4 853.333333l0-109.226667 112.64 0 0-71.68L71.68 672.426667 71.68 153.6l853.333333 0L925.013333 443.733333l58.026667 0c3.413333 0 10.24 0 13.653333 3.413333L996.693333 129.706667c0-27.306667-20.48-47.786667-47.786667-47.786667L47.786667 81.92C20.48 81.92 0 102.4 0 129.706667l0 566.613333c0 27.306667 20.48 47.786667 47.786667 47.786667l337.92 0L385.706667 853.333333 256 853.333333c-23.893333 0-44.373333 20.48-44.373333 44.373333 0 23.893333 20.48 44.373333 44.373333 44.373333l481.28 0c-6.826667-10.24-10.24-20.48-10.24-30.72L727.04 853.333333 723.626667 853.333333z M993.28 467.626667l-201.386667 0c-17.066667 0-30.72 13.653333-30.72 30.72l0 409.6c0 17.066667 13.653333 30.72 30.72 30.72l201.386667 0c17.066667 0 30.72-13.653333 30.72-30.72l0-409.6C1024 484.693333 1010.346667 467.626667 993.28 467.626667zM890.88 921.6c-6.826667 0-13.653333-6.826667-13.653333-13.653333 0-6.826667 6.826667-13.653333 13.653333-13.653333s13.653333 6.826667 13.653333 13.653333C904.533333 914.773333 897.706667 921.6 890.88 921.6zM1003.52 877.226667l-225.28 0 0-341.333333 225.28 0L1003.52 877.226667z",
              symbolSize: 40,
              itemStyle: {
                normal: {
                  // color: '#42b983',
                  color: "rgb(55, 148, 255)"
                }
              },
              deviceInfo: item.hostAddress
            };
            this.dataList.push(this.centerDevice);
          });
        }
      }
      // 源节点对象(即组件视角)
      this.dataItem = {
        name: this.list[0].componentHistoryEntity.name,
        info: this.list[0],
        id: this.list[0].componentHistoryEntity.id
      };
      this.dataList.push(this.dataItem);
      // 循环遍历
      for (let i = 0; i < this.list.length; i++) {
        this.list[i].deploymentDesignNodeEntity.deviceEntity.forEach(item => {
          let linksItem = {
            source: this.list[i].componentHistoryEntity.id,
            target: item.name
          };
          this.linksList.push(linksItem);
        });
      }

      if (this.linksList.length > 0) {
        this.title = "设备组件关系图";
      } else {
        this.title = "设备组件关系图(该节点暂无信息)";
      }
    },
    watchClick() {}
  },
  watch: {
    // 深度监听数组
    detaillist: {
　　　　handler(newValue, oldValue) {
　　　　　　for (let i = 0; i < newValue.length; i++) {
　　　　　　　　if (oldValue[i] != newValue[i]) {
　　　　　　　　　　// console.log(newValue)
                this.list = this.detaillist;
                this.initConfig();
                this.initChart();
　　　　　　　　}
　　　　　　}

　　　　},
　　　　deep: true,
　　}
  }
};
</script>

